modules/nixos/apps/editor/doom-emacs/doom/doom.org
*** "F" Focus Configuration
#+BEGIN_SRC emacs-lisp :tangle config.el
(map! :leader
      :prefix ("F" . "Focus mode")
      :desc "Toggle focus mode"
      "t" 'focus-mode

      :desc "Pin focused section"
      "p" 'focus-pin

      :desc "Unpin focused section"
      "u" 'focus-unpin)

#+END_SRC

*** "P" Print Configuration
#+BEGIN_SRC emacs-lisp :tangle config.el
(map! :leader
      :prefix ("P" . "Print")
      :desc "Simple print buffer in web browser"
      "p" 'org-simple-print-buffer

      :desc "Simple print buffer in web browser"
      "b" 'org-simple-print-buffer)

#+END_SRC

*** "N" org-roam Configuration
#+BEGIN_SRC emacs-lisp :tangle config.el
(map! :leader
      :prefix ("N" . "org-roam Notes")
      :desc "Visualize org-roam database with org-roam-ui"
      "v" 'org-roam-ui-open

      :desc "Kill all org-roam ui buffers"
      "V" 'kill-org-roam-ui)

#+END_SRC

*** "o" Open Configuration
#+BEGIN_SRC emacs-lisp :tangle config.el
(map! :leader
      :prefix ("o" . "Open")
      :desc "Open org timeblock"
      "c" 'org-timeblock

      :desc "Switch to specific org agenda file"
      "a s" 'list-and-switch-to-agenda-file

      :desc "Refresh org agenda from roam dbs"
      "r" 'org-roam-refresh-agenda-list)

#+END_SRC

*** "p" Projectile Configuration
#+BEGIN_SRC emacs-lisp :tangle config.el
(map! :leader
      :prefix ("p" . "Projectile")
      :desc "Open project"
      "p" #'projectile-goto-project

      :desc "Projectile commander"
      "@" #'projectile-commander)

#+END_SRC

*** org-agenda Configuration
#+BEGIN_SRC emacs-lisp :tangle config.el
(map!
  :map evil-org-agenda-mode-map
  :after org-agenda
  :nvmeg "s d" #'org-agenda-toggle-completed)
(map!
  :map evil-org-agenda-mode-map
  :after org-agenda
  :nvmeg "<RET>" #'org-agenda-switch-with-roam
  :nvmeg "<return>" #'org-agenda-switch-with-roam)
(map!
  :map org-agenda-mode-map
  :after org-agenda
  :nvmeg "<RET>" #'org-agenda-switch-with-roam
  :nvmeg "<return>" #'org-agenda-switch-with-roam)

#+END_SRC

*** org-super-agenda Configuration
#+BEGIN_SRC emacs-lisp :tangle config.el
(map! :desc "Next line"
      :map org-super-agenda-header-map
      "j" 'org-agenda-next-line)

(map! :desc "Next line"
      :map org-super-agenda-header-map
      "k" 'org-agenda-previous-line)

#+END_SRC

*** org-timeblock Configuration
#+BEGIN_SRC emacs-lisp :tangle config.el
(map! :desc "Next day"
      :map org-timeblock-mode-map
      :nvmeg "l" 'org-timeblock-day-later)
(map! :desc "Previous day"
      :map org-timeblock-mode-map
      :nvmeg "h" 'org-timeblock-day-earlier)
(map! :desc "Schedule event"
      :map org-timeblock-mode-map
      :nvmeg "m" 'org-timeblock-schedule)
(map! :desc "Event duration"
      :map org-timeblock-mode-map
      :nvmeg "d" 'org-timeblock-set-duration)

#+END_SRC

*** Org Roam Keybindings
#+BEGIN_SRC emacs-lisp :tangle config.el
(map! :leader
      :prefix ("N" . "org-roam notes")

      :desc "Capture new roam node"
      "c" 'org-roam-capture

      :desc "Open org roam inbox"
      "I o" 'org-roam-open-inbox

      :desc "Capture stuff in inbox"
      "I c" 'org-roam-capture-inbox

      :desc "Insert roam node link at point"
      "i" 'org-roam-node-insert

      :desc "Find roam node"
      "." 'org-roam-node-find

      :desc "Switch org-roam database"
      "s" 'org-roam-switch-db

      :desc "Update current org-roam database"
      "u" 'org-roam-db-sync

      :desc "Re-zoom on current node in org-roam-ui"
      "z" 'org-roam-ui-node-zoom

      :desc "Visualize org-roam database with org-roam-ui"
      "O" 'org-roam-default-overview

      :desc "Visualize org-roam database with org-roam-ui"
      "o" 'org-roam-open-dashboard)

#+END_SRC

